/*******************************************************************************
*  COPYRIGHT XINWEI Communications Equipment CO.,LTD
********************************************************************************
* 源文件名:           bsp_phy.c 
* 功能:                  
* 版本:                                                                  
* 编制日期:                              
* 作者:                                              
*******************************************************************************/
/************************** 包含文件声明 **********************************/
/**************************** 共用头文件* **********************************/
#include <stdio.h>

/**************************** 私用头文件* **********************************/
#include "../../../com_inc/bsp_types.h"
/*#include "bsp_phy_bcm54618.h"*/
#include "../../../com_inc/fsl_p2041_ext.h"
#include "../inc/bsp_phy.h"
#include "../inc/bsp_phy_app.h"

/******************************* 局部宏定义 *********************************/


/*********************** 全局变量定义/初始化 **************************/
struct bsp_mdio *mdio_dev[1] ;

/************************** 局部常数和类型定义 ************************/



/*************************** 局部函数原型声明 **************************/

/************************************ 函数实现 *****************************/
#if 0
s32 bsp_phy_init(void)
{
    s32 s32Rv;
    u32 u32PhyId;
    /* 初始化SPI接口 */
    printf("bsp_phy_init..\n"); 
    mdio_dev[0] =(struct bsp_mdio *) (g_u8ccsbar + CONFIG_SYS_MDIO1_OFFSET);
    /* 初始化BCM54618芯片 */
    for(u32PhyId = 0; u32PhyId < 3; u32PhyId ++)
    {
        s32Rv = phy_bcm54618_init(u32PhyId);
        if (0 != s32Rv)
        {
            printf("SORRY, phy_bcm54618_init(u32PhyId is %d) failed!\n",u32PhyId);    
            return (E_PHY_INIT_FAILED);
        }
    }
    return (s32Rv);
}
#endif
/******************************* 源文件结束 ********************************/
