/*******************************************************************************
*  COPYRIGHT XINWEI Communications Equipment CO.,LTD
********************************************************************************
* 源文件名:           bsp_spi_ext.h 
* 功能:               SPI应用层接口文件   
* 版本:                                                                  
* 编制日期:                              
* 作者:                    hjf                          
*******************************************************************************/
#ifndef BSP_SPI_EXT_H
#define BSP_SPI_EXT_H

/********************************************************************************
* 函数名称: bsp_spi_init							
* 功    能:  初始化SPI                                   
* 相关文档:                    
* 函数类型:									
* 参    数: 						     			
* 参数名称		   类型					输入/输出 		描述	
* 说   明:  板级外设初始化时调用
*********************************************************************************/
Export void bsp_spi_init(void);

/********************************************************************************
* 函数名称: spi_setup_slave							
* 功    能: 设置各个通道的属性                                  
* 相关文档:                    
* 函数类型:									
* 参    数: 						     			
* 参数名称		   类型					输入/输出 		描述	
	max_hz :时钟频率
	mode   :模式   可固定   
	        SPI_CPHA	0x01		clock phase 
            SPI_CPOL	0x02		clock polarity 
* 说   明: 
*********************************************************************************/
Export s32 bsp_spi_setup_slave(u32 u32cs,u32 u32max_hz, u32 u32mode);
Export s32 bsp_spi_read(u32 u32cs,u8 *u8pread_data, u32 u32data_len);
Export s32 bsp_spi_write(u32 u32cs, u8 *u8pwrite_data, u32 u32data_len);

/********************************************************************************
* 函数名称: bsp_spi_dac_write							
* 功    能: D/A输出操作，24 bits                              
* 相关文档:                    
* 函数类型:									
* 参    数: 						     			
* 参数名称		   类型			输入/输出 		描述	
* 说   明: 
*********************************************************************************/
Export s32 spi_dac_write(u8 u8_mod,u16 u16da_data);

#endif
/******************************* 头文件结束 ********************************/

