/*******************************************************************************
*  COPYRIGHT XINWEI Communications Equipment CO.,LTD
********************************************************************************
* 源文件名:           bbu_config.h 
* 功能:                  
* 版本:                                                                  
* 编制日期:                              
* 作者:                                              
*******************************************************************************/
#ifndef BSP_DSP_EXT_H
#define BSP_DSP_EXT_H

/********************************************************************************
* 函数名称:   dsp boot						
* 功    能:                                    
* 相关文档:                    
* 函数类型:									
* 参    数: 						     			
* 参数名称		   类型					输入/输出 		描述	
* 说   明:  
*********************************************************************************/
Export s32 bsp_reset_dsp(u32 u32DspId);
Export s32 bsp_dsp_download(u32 u32DspId, const s8* pFileTem);
Export s32 test_bsp_dsp_download(u8 u8dspid);

#endif
/******************************* 头文件结束 ********************************/

