/*******************************************************************************
*  COPYRIGHT XINWEI Communications Equipment CO.,LTD
********************************************************************************
* 源文件名:           bbu_config.h 
* 功能:                  
* 版本:                                                                  
* 编制日期:                              
* 作者:                                              
*******************************************************************************/
#ifndef BSP_EPLD_H
#define BSP_EPLD_H

typedef struct
{
	unsigned char feature[8];
	unsigned char feabits[2];
} XO2FeatureRow_t;

#endif
/******************************* 头文件结束 ********************************/
